# -*- coding: utf-8 -*-
"""Untitled6.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1AOf5ZQh64aNTSYbIH79kuiNGFocU18eO
"""

import numpy as 
import random

"""1) Создать матрицу размером 10х10 с 0 внутри, и 1 на границах. Например для 3х3.

"""

a = np.ones((10,10))
a[1:-1,1:-1] = 0
print(Z)

"""2) Создать 5x5 матрицу с 1,2,3,4 над диагональю. Все остальные элементы - 0.



"""

a = np.diag(np.arange(1, 5), k = 1)
print(a)

"""3) Создайте случайную матрицу и вычтите из каждой строки среднее.

"""

X = np.random.rand(5, 10)
print(X)
Y = X.mean()
print(Y)

"""4) Создать Массив размерностью (6,7). Поменять в массиве 3 строку с последней."""

a = np.arange(1, 43).reshape(6,7)
#a = a[2::-1]
'''for x in range(a.shape[0]):
    #print('Строка:', x)
    a[]
    for y in range(a.shape[1]):
        print(a[x, y])'''
for x in range(a.shape[2])
  a = a[]
print(a)


"""Считайте 2 числа: n, m.

Создайте матрицу размера n*m и "раскрасьте" её в шахматную раскраску.

0 - "чёрное"

1 - "белое"

Ячейка с координатами (0, 0) всегда "чёрная" (т.е. элемент (0, 0) равен 0). Матрицу сохраните в переменную Z.
"""

n, m = map(int, input().split())
Z = np.zeros((n, m))
for i in range(n):
    for j in range(m):
        if (i + j) % 2 != 0:
            Z[i, j] = 1 
print(Z)


Задача 9.

Даны 2 вектора целых чисел A и B.

Найдите числа, встречающиеся в обоих векторах и составьте их по возрастанию в вектор Z.

Если пересечений нет, то вектор Z будет пустым."""

A = np.array([int(y) for y in input().split()])
B = np.array([int(z) for z in input().split()])
Z = []
for i in range(len(A)):
    for j in range(len(B)):
        if A[i] == B[j]:
            Z.append(A[i])
Z = sorted(Z)
print(Z)
