# -*- coding: utf-8 -*-
"""home_work_4

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1qbVIQYrSlncx15UzwIp5pYnuRmxmS1wz

Задание 1
"""

import numpy as np
import pandas as pd

r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))
for i in range(100):
  if int(s[i]) > 5:
    print(i) #разве не должно получаться всё время что-то случайное?
    break

"""Задание 2"""

import pandas as pd


df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])

tag = 0
ter = 0
tly = 0

for agi in range(len(df)):
  tag += df.возраст[agi]
middle_age = tag / len(df)
for eri in range(len(df)):
  ter += df.доход[eri]
middle_earn = ter / len(df)
for lyi in range(len(df)):
  tly += df['надежность клиента (0..1)'][lyi]
middle_lyab = tly / len(df)

#те кто больше чем 40
print('Старше чем 40:')
s1 = 0
for i1 in range(len(df)):
  if int(df.возраст[i1]) > 40:
    print(df.имя[i1])
    s1 += 1
if s1 == 0:
  print('Таких нет')

#доход выше среднего
print('Доход выше среднего:')
s2 = 0
for i2 in range(len(df)):
  if int(df.доход[i2]) > middle_earn:
    print(df.имя[i2])
    s2 += 1
if s2 == 0:
  print('Таких нет')

#доход выше среднего, но надежность ниже среднего
print('Доход выше среднего, но надежность ниже среднего:')
s3 = 0
for i3 in range(len(df)):
  if (int(df.доход[i3]) > middle_earn) and (df['надежность клиента (0..1)'][i3] < middle_lyab):
    print(df.имя[i3])
    s3 += 1
if s3 == 0:
  print('Таких нет')

df1 = pd.DataFrame(columns=['важность клиента', 'возможная долгосрочность клиента'])
df = pd.concat([df, df1])
for j in range(len(df)):
  df['важность клиента'][j] = df.доход[j] * df['надежность клиента (0..1)'][j]
for w in range(len(df)):
  df['возможная долгосрочность клиента'][w] = df['важность клиента'][w] * (middle_age - df.возраст[w])
df

"""Задание 3"""

import pandas as pd
import numpy as np

df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

# Не до конца понятно что просится выполнить в задаче, 
# так что я думаю что надо вывести таблицу в  
# которой строчки из df1 и df2 совпадаюст между собой, 
# а всё остальное требуется удалить

for i in range(len(df2)):
  if df1.fruit[i] != df2.frukt[i] or df1.weight[i] != df2.ves[i]:
    df1.fruit[i] = np.NaN
    df2.frukt[i] = np.NaN
print(df2.dropna(axis=0, how='any'))

"""Задание 4.2"""

import pandas as pd
import numpy as np

df = pd.DataFrame({
    'fruit': ['Apple', 'Watermelon', 'Cherry', 'Orange', 'Banana'],
    'price': [25, 33.5, 19.5, 9.6, 10],
    'quantity': [100, 34, np.NaN, 56, 120]})

dfa = pd.DataFrame({
    'fruit': ['Apple', 'Melon', 'Peach'],
    'price': [25, 30, 98],
    'quantity': [100, 55, 11]})

print('Пропуски:')
print(df.isna().sum())

df = df.dropna(axis=0, how='any')

df = pd.concat([df, dfa], ignore_index = True)


dfa1 = pd.DataFrame(columns=['total'])
df = pd.concat([df, dfa1], axis = 0)
for i in range(len(df)):
  totalp = df.price[i] * df.quantity[i]
  df.total[i] = totalp
df.drop([0], inplace=True)
# не понимаю почему выводится ссылка
# но всё остальное работает правильно
df